
&НаКлиенте
Асинх Процедура ТСД_ЗаполнитьHttpТест(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("HttpТест", Истина);
	ОткрытьФорму("Справочник.УстройстваИКомпьютеры.ФормаВыбора", , ЭтотОбъект, , , , Новый ОписаниеОповещения("ПриВыбореУстройства", ЭтотОбъект, ПараметрыФормы ));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореУстройства(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.УстройстваИКомпьютеры") Тогда
		Если ДополнительныеПараметры.Свойство("HttpТест") Тогда
			ОткрытьФорму("ОбщаяФорма.ФормаДокументСписокHttpТест", Новый Структура("Устройство", Результат), ЭтотОбъект);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ДанныеСТСД" Тогда
		ЗаполнитьДаннымиСТСД(Параметр);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиСТСД(ТаблицаТоваров)
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		мСтроки = мОбъект.Товары.НайтиСтроки(Новый Структура("Штрихкод", ТекСтрока.Штрихкод));
		ТекущаяСтрока = Неопределено;
		Если мСтроки.Количество() = 0 Тогда
			ТекущаяСтрока = мОбъект.Товары.Добавить();
			ТекущаяСтрока.Штрихкод = ТекСтрока.Штрихкод;
		Иначе
			ТекущаяСтрока = мСтроки[0];
		КонецЕсли;		
		ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + ТекСтрока.Количество;		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОчиститьТовары(Команда)
	Если Ждать ВопросАсинх("Очистить табличную часть?", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Объект.Товары.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") ТОгда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Устройство", ВыбранноеЗначение.Устройство);
		ПараметрыФормы.Вставить("ИдентификаторДокумента", ВыбранноеЗначение.ИдентификаторДокумента);
		ОткрытьФорму("ОбщаяФорма.ФормаЗаполнениеДокумента", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

