
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КлючОбъекта = "WebCore";
	КлючНастроек = "Настройки";
	ЛокальныеНастройки = Новый Структура();
	ЛокальныеНастройки.Вставить("КаталогОтладки", КаталогОтладки);
	ЛокальныеНастройки.Вставить("РежимОтладки", РежимОтладки);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, ЛокальныеНастройки, ,ИмяПользователя());	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЛокальныеНастрокйки = МенеджерВебСокетВызовСервера.ПолучитьЛокальныеНастройкиКлиента();

	Если ТипЗнч(ЛокальныеНастрокйки) = Тип("Структура") ТОгда
		КаталогОтладки = ЛокальныеНастрокйки.КаталогОтладки;
		РежимОтладки = ЛокальныеНастрокйки.РежимОтладки;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура КаталогОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Результат = Ждать Диалог.ВыбратьАсинх();	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		КаталогОтладки = Результат[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура КаталогУстановкиСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Результат = Ждать Диалог.ВыбратьАсинх();	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		НаборКонстант.КаталогБинарныхФайловСервера = Результат[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
