
//@skip-check module-structure-method-in-regions
&НаКлиенте
Асинх Процедура ПутьККаталогуКомпонентыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		НаборКонстант.ПутьККаталогуКомпоненты = Результат[0];
	КонецЕсли;	
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Асинх Процедура КаталогУстановкиСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		НаборКонстант.КаталогУстановкиСервера = Результат[0];
	КонецЕсли;	
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПутьККаталогуКомпоненты.Доступность = НаборКонстант.РежимОтладки;
	
КонецПроцедуры


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)
	Элементы.ПутьККаталогуКомпоненты.Доступность = НаборКонстант.РежимОтладки;
КонецПроцедуры
