

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КлючОбъекта = "WebCore";
	КлючНастроек = "Настройки";
	ЛокальныеНастройки = МенеджерВебСокетВызовСервера.ПолучитьЛокальныеНастройкиКлиента();
	ЛокальныеНастройки.Вставить("КаталогОтладки", КаталогОтладки);
	ЛокальныеНастройки.Вставить("РежимОтладки", РежимОтладки);
	Если НЕ ИспользоватьУчетныеДанныеТекущегоПользователя Тогда
		ЛокальныеНастройки.Вставить("ИмяПользователя", ИмяПользователя);
		ЛокальныеНастройки.Вставить("ХешПользователя", ХешПользователя);
	Иначе
		ЛокальныеНастройки.Вставить("ИмяПользователя", ИмяПользователя());
		Идентификатор = Пользователи.ПустойУникальныйИдентификатор();
		Если Метаданные.Справочники.Найти("Пользователи") = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя());
			Идентификатор = ПользовательИБ.УникальныйИдентификатор;
		Иначе
			ТекущийПользователь = Пользователи.ТекущийПользователь();
			Идентификатор = ТекущийПользователь.УникальныйИдентификатор();
		КонецЕсли;
		ИсходнаяСтрока = НРег(ЛокальныеНастройки.ИмяПользователя) + XMLСтрока(Идентификатор);
		ЛокальныеНастройки.Вставить("ХешПользователя", НРЕг(ПолучитьХешСуммы(ИсходнаяСтрока)));
	КонецЕсли;	
	ЛокальныеНастройки.Вставить("ИспользоватьДанныеПользователя", ИспользоватьУчетныеДанныеТекущегоПользователя);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, ЛокальныеНастройки, ,ИмяПользователя());	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЛокальныеНастройки = МенеджерВебСокетВызовСервера.ПолучитьЛокальныеНастройкиКлиента();

	Если ТипЗнч(ЛокальныеНастройки) = Тип("Структура") ТОгда
		КаталогОтладки = ЛокальныеНастройки.КаталогОтладки;
		РежимОтладки = ЛокальныеНастройки.РежимОтладки;	
		ИспользоватьУчетныеДанныеТекущегоПользователя = ЛокальныеНастройки.ИспользоватьДанныеПользователя;
		ИмяПользователя = ЛокальныеНастройки.ИмяПользователя;
		ХешПользователя = ЛокальныеНастройки.ХешПользователя;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТребуетсяАвторизацияНаСервереПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Асинх Процедура КаталогОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Результат = Ждать Диалог.ВыбратьАсинх();	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		КаталогОтладки = Результат[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура КаталогУстановкиСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Результат = Ждать Диалог.ВыбратьАсинх();	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		НаборКонстант.РабочийКаталогСервера = Результат[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУчетныеДанныеТекущегоПользователяПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура УстановитьПарольПользователя(Команда)
#Если НЕ ВебКлиент Тогда
	Если СокрЛП(ИмяПользователя) = "" Тогда
		Ждать ПредупреждениеАсинх("Не указано имя пользователя!");
		Возврат;
	КонецЕсли;
#КонецЕсли			
	Элементы.ГруппаПароль.Видимость = Истина;
	Элементы.УстановитьПарольПользователя.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолучитьХешУчетныхДанных(Команда)
	ИсходнаяСтрока = НРег(ИмяПользователя) + ПарольПользователя;
	ХешПользователя = НРЕг(ПолучитьХешСуммы(ИсходнаяСтрока));
	Элементы.ГруппаПароль.Видимость = Ложь;
	Элементы.УстановитьПарольПользователя.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура HttpСервисПоказатьПароль(Команда)
	Если Команда.Пометка Тогда
		Элементы.HttpСервисПоказатьПароль.Картинка = БиблиотекаКартинок.СкрытьПароль;
		Элементы.HttpСервисПароль.РежимПароля = Ложь;
	Иначе
		Элементы.HttpСервисПоказатьПароль.Картинка = БиблиотекаКартинок.ПоказатьПароль;
		Элементы.HttpСервисПароль.РежимПароля = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура DavСервисПоказатьПароль(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Элементы.ИмяПользователя.Доступность = НЕ ИспользоватьУчетныеДанныеТекущегоПользователя;
	Элементы.ИмяПользователя.АвтоОтметкаНезаполненного = НЕ ИспользоватьУчетныеДанныеТекущегоПользователя;
	Элементы.УстановитьПарольПользователя.Доступность = НЕ ИспользоватьУчетныеДанныеТекущегоПользователя;		
	Элементы.ГруппаУчетныеДанные.Доступность = НаборКонстант.ТребуетсяАвторизацияНаСервере;
	Элементы.ИспользоватьУчетныеДанныеТекущегоПользователя.Доступность = НаборКонстант.ТребуетсяАвторизацияНаСервере;
КонецПроцедуры

&НаСервере
Функция ПолучитьХешСуммы(ИсходнаяСтрока)
	ХешированиеДанных  = Новый ХешированиеДанных (ХешФункция.SHA1) ;
 	ХешированиеДанных.Добавить(ИсходнаяСтрока);
 	Возврат ПолучитьHexСтрокуИзДвоичныхДанных(ХешированиеДанных.ХешСумма)
КонецФункции

#КонецОбласти


