#Область ПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если глВебСокетКлиент = Неопределено Тогда
		глВебСокетКлиент = Новый Структура();
		глВебСокетКлиент.Вставить("ПараметрыПодключения", Новый Структура());
		глВебСокетКлиент.Вставить("ОбъектКомпоненты", Неопределено);
		глВебСокетКлиент.Вставить("НастройкиКлиента", МенеджерВебСокетВызовСервера.ПолучитьЛокальныеНастройкиКлиента());	
	КонецЕсли;
	
	ПодключитьКомпоненту();
	
КонецПроцедуры

Функция ИмяМодуляКомпоненты() Экспорт
	Возврат "AddIn.WebCore.WebSocketClient";
КонецФункции

Функция ИмяКомпоненты() Экспорт
	Возврат "WebCore";
КонецФункции

Асинх Функция ПодключитьКомпоненту() Экспорт
	
	РежимОтладки = глВебСокетКлиент.НастройкиКлиента.РежимОтладки;
	Местоположение = "";
	
	_ИмяКомпоненты = НРег(ИмяКомпоненты());
	Система = Новый СистемнаяИнформация;
	Расширение = "dll";
	Если Система.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		_ИмяКомпоненты = _ИмяКомпоненты + "_x64";
	ИначеЕсли Система.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда 
		_ИмяКомпоненты = "lib" + _ИмяКомпоненты;
		Расширение = "so";
	КонецЕсли;

	_ИмяКомпоненты = _ИмяКомпоненты + "." + Расширение;
	
	Если РежимОтладки ТОгда
		Местоположение = глВебСокетКлиент.НастройкиКлиента.КаталогОтладки;
		Если СокрЛП(Местоположение) = "" Тогда
			МенеджерВебСокетВызовСервера.Ошибка("МенеджерВебСокетКлент::ПодключитьКомпоненту", "Не указан каталог отладки!");
			Возврат Ложь;
		КонецЕсли;
		Местоположение = Местоположение + ПолучитьРазделительПутиКлиента() + _ИмяКомпоненты;
	Иначе
		//Код получения файла из макета
	КонецЕсли;
	
	Файл = Новый Файл(Местоположение);
	Если НЕ Ждать Файл.СуществуетАсинх() ТОгда
		МенеджерВебСокетВызовСервера.Ошибка("МенеджерВебСокетКлент::ПодключитьКомпоненту", "Файл внешней компоненты не найден!");
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ждать ПодключитьВнешнююКомпонентуАсинх(Местоположение, ИмяКомпоненты(), ТипВнешнейКомпоненты.Native);
	
	Если НЕ Результат Тогда
		МенеджерВебСокетВызовСервера.Ошибка("МенеджерВебСокетКлент::ПодключитьКомпоненту", "Ошибка подключения вшеней компоненты!");
		Возврат Ложь;	
	КонецЕсли;
		
	Попытка
		глВебСокетКлиент.ОбъектКомпоненты = Новый (ИмяМодуляКомпоненты());
		МенеджерВебСокетВызовСервера.Лог("МенеджерВебСокетКлент::ПодключитьКомпоненту", "Успешное подключение внешней компоненты!");
	Исключение
		МенеджерВебСокетВызовСервера.Ошибка("МенеджерВебСокетКлент::ПодключитьКомпоненту", ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат глВебСокетКлиент.ОбъектКомпоненты <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти





