#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	МенеджерВебСокетКлиент.ФормаПриЗакрытии(УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если глВебСокетКлиент = Неопределено ИЛИ глВебСокетКлиент.ОбъектКомпоненты = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, "Компонента не загружена!");
		Возврат;
	КонецЕсли;
	
	МенеджерВебСокетКлиент.ПодключитьФорму(ЭтотОбъект, Новый ОписаниеОповещения("ПриПолученииСоообщения",  ЭтотОбъект), Новый ОписаниеОповещения("ПриОшибке", ЭтотОбъект));
	
	МенеджерВебСокетКлиент.ПолучитьСписокАктивныхПользователей(УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьСписок()
	СписокПользователей.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииСоообщения(Результат, ДополнителныеПараметры) Экспорт
	Попытка
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Если Результат.command = "ServerUsersList" Тогда
				ОчиститьСписок();
//				ОтветСервераТаблица = МенеджерВебСокетВызовСервера.ОбработатьОтветСервера(Результат.result);
//				Если ТипЗнч(ОтветСервераТаблица) = Тип("Структура") Тогда
//					Строки = ОтветСервераТаблица.rows;
//					Если ТипЗнч(Строки) = Тип("Массив") тогда
//						ЗаполнитьТаблицуАктивныхПользователей(Строки);
//					КонецЕсли;
//				КонецЕсли;
//			ИначеЕсли Результат.command = "ClientLeave" Тогда 
//				ПриОтключенииПользователя(Результат.sender);
//			ИначеЕсли Результат.command = "ClientJoin" Тогда 
//				МенеджерВебСокетКлиент.ПолучитьСписокАктивныхПользователей(УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
	Исключение
		//@skip-check use-non-recommended-method
		Сообщить("Не верный формат сообщения!", СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПриОшибке(Результат, ДополнителныеПараметры) Экспорт
	//@skip-check use-non-recommended-method
	Сообщить("ФормаАктивныеПользователи::ПриОшибке");
КонецПроцедуры


#КонецОбласти