
#Область СлужебныеПроцедурыИФункции

Функция КаталогБинарныхФайловНаСервере() Экспорт
	
КонецФункции

Функция ПолучитьСтруктуруЛокальныхНастроек()
	Настройки = Новый Структура;
	Настройки.Вставить("РежимОтладки", Ложь); //для отладки внешней компоненты, можно использовать для явного указания местонахождения файла
	Настройки.Вставить("КаталогОтладки", ""); //каталог с бинарными файлами внешней компоененты
	Настройки.Вставить("ИспользоватьДанныеПользователя", Истина); //Будет использоваться текущее имя пользователя и идентификатор
	//в качестве данных авторизации на сервере, //sha1 пары ВРЕг(ИмяПользователя) + Строка(УникальныйИдентификатор)
	Настройки.Вставить("ИмяПользователя", ""); //имя пользователя, указывается в случае если не используется данные текущего пользователя
	Настройки.Вставить("ХешПользователя", ""); //sha1 пары ВРЕг(ИмяПользователя) + Пароль
	Возврат Настройки;
КонецФункции

Функция ПолучитьЛокальныеНастройкиКлиента() Экспорт
	
	мРеквизитыКлиента = Новый Массив;
	мРеквизитыКлиента.Добавить(Новый Структура("РежимОтладки", Ложь));
	мРеквизитыКлиента.Добавить(Новый Структура("КаталогОтладки", ""));
	
	ЛокальныеНастрокйки = ПолучитьСтруктуруЛокальныхНастроек();
	
	КлючОбъекта = "WebCore";
	КлючНастроек = "Настройки";
	ИмяПользователя = ИмяПользователя();

    _ЛокальныеНастрокйки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,ИмяПользователя);

	Если НЕ _ЛокальныеНастрокйки = Неопределено Тогда
		Для Каждого Элемент Из _ЛокальныеНастрокйки Цикл
			Если ЛокальныеНастрокйки.Свойство(Элемент.Ключ) Тогда
				ЛокальныеНастрокйки[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;

	Возврат ЛокальныеНастрокйки;
	
КонецФункции

Процедура Ошибка(ЗаголовокОшибки, ОписаниеОшибки) Экспорт
	ЗаписьЖурналаРегистрации("WebSocketClient", УровеньЖурналаРегистрации.Ошибка, , , ЗаголовокОшибки + ": " + ОписаниеОшибки)
КонецПроцедуры

Процедура Лог(ЗаголовокСообщения, ТекстСообщения) Экспорт
	ЗаписьЖурналаРегистрации("WebSocketClient", УровеньЖурналаРегистрации.Информация, , , ЗаголовокСообщения + ": " + ТекстСообщения)
КонецПроцедуры

#КонецОбласти



