

#Область ОбработчикиСобытий
#Если Сервер ТОгда
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		ТекущийПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если ТекущийПользовательИБ <> Неопределено Тогда
			Если Код <> ТекущийПользовательИБ.Имя Тогда
				Код = ТекущийПользовательИБ.Имя;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
#КонецОбласти

